<a href="https://colab.research.google.com/github/vence-andersen/M5-Forecasting-Accuracy/blob/main/Feature_Engineering.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
# from google.colab import files
# files.upload()

In [3]:
# !mkdir -p ~/.kaggle
# !cp kaggle.json ~/.kaggle/
# !chmod 600 ~/.kaggle/kaggle.json

In [4]:
# ! kaggle competitions download -c m5-forecasting-accuracy

In [5]:
# !unzip sales_train_evaluation.csv.zip
# !unzip sales_train_validation.csv.zip
# !unzip sample_submission.csv.zip
# !unzip sell_prices.csv.zip

In [6]:
# ! pip install downcast
# ! python -m pip install "dask[complete]"

In [7]:
import numpy as np
import pandas as pd
from downcast import reduce
from dask import dataframe as dd

In [8]:
# Using Pandas to reasd the files.

sales = pd.read_csv("sales_train_evaluation.csv")
sell_price = pd.read_csv("sell_prices.csv")
cal = pd.read_csv("calendar.csv")

In [9]:
for i in range(1941, 1941+29):
    sales['d_'+str(i)] = np.int8(0)

In [10]:
sales.head(2)

                              id        item_id  ... d_1968 d_1969
0  HOBBIES_1_001_CA_1_evaluation  HOBBIES_1_001  ...      0      0
1  HOBBIES_1_002_CA_1_evaluation  HOBBIES_1_002  ...      0      0

[2 rows x 1975 columns]

In [11]:
sales.memory_usage().sum()/1024**2

453.5223560333252

In [12]:
sales = reduce(sales)

In [13]:
sales.memory_usage().sum()/1024**2

97.36645126342773

In [14]:
data = pd.melt(sales, id_vars=['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id'],
          var_name='day', value_name='demand').dropna()
print("The new shape is ",data.shape)
data.head(2)

The new shape is  (60034810, 8)

                              id        item_id  ...  day demand
0  HOBBIES_1_001_CA_1_evaluation  HOBBIES_1_001  ...  d_1      0
1  HOBBIES_1_002_CA_1_evaluation  HOBBIES_1_002  ...  d_1      0

[2 rows x 8 columns]

In [15]:
data.memory_usage().sum()/1024**2

1490.1800117492676

In [16]:
data = reduce(data)

In [17]:
data.memory_usage().sum()/1024**2

1146.751220703125

In [18]:
cal.fillna('No_Event', inplace=True)

In [19]:
cal = reduce(cal)

In [20]:
data = data.merge(cal, left_on='day', right_on='d')

In [21]:
data.head(2)

                              id        item_id  ... snap_TX snap_WI
0  HOBBIES_1_001_CA_1_evaluation  HOBBIES_1_001  ...       0       0
1  HOBBIES_1_002_CA_1_evaluation  HOBBIES_1_002  ...       0       0

[2 rows x 22 columns]

In [22]:
data.shape

(60034810, 22)

In [23]:
data = reduce(data)

In [24]:
sell_price.head(2)

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58

In [25]:
sell_price.memory_usage().sum()/1024**2

208.77456665039062

In [26]:
sell_price = reduce(sell_price)

In [27]:
sell_price.memory_usage().sum()/1024**2

45.771300315856934

In [28]:
data = data.merge(sell_price,on=['store_id','item_id', 'wm_yr_wk'], how='left')

In [29]:
data.memory_usage().sum()/1024**2

2635.4417304992676

In [30]:
data = reduce(data)

In [31]:
data.memory_usage().sum()/1024**2

2635.4417304992676

In [32]:
print(f" There are {data['sell_price'].isna().sum()} missing values in sell_price column")

 There are 12299413 missing values in sell_price column

In [33]:
data.head(2)

                              id        item_id  ... snap_WI sell_price
0  HOBBIES_1_001_CA_1_evaluation  HOBBIES_1_001  ...       0        NaN
1  HOBBIES_1_002_CA_1_evaluation  HOBBIES_1_002  ...       0        NaN

[2 rows x 23 columns]

In [34]:
data['sell_price'].fillna(data.groupby('id')['sell_price'].transform('mean'), inplace=True)

In [35]:
print(f" There are {data['sell_price'].isna().sum()} missing values in sell_price column")

 There are 0 missing values in sell_price column

In [36]:
data.memory_usage().sum()/1024**2

2635.4417304992676

In [37]:
data = reduce(data)

In [38]:
data.memory_usage().sum()/1024**2

2635.4417304992676

In [39]:
print(f"There are {data.isna().sum().sum()} missing values in the data")

There are 0 missing values in the data

In [40]:
data['day'] = data['day'].str.split('_').str[1]

In [41]:
data.drop('d', axis=1, inplace=True)

In [42]:
data

                                     id        item_id  ... snap_WI sell_price
0         HOBBIES_1_001_CA_1_evaluation  HOBBIES_1_001  ...       0   8.281250
1         HOBBIES_1_002_CA_1_evaluation  HOBBIES_1_002  ...       0   3.970703
2         HOBBIES_1_003_CA_1_evaluation  HOBBIES_1_003  ...       0   2.970703
3         HOBBIES_1_004_CA_1_evaluation  HOBBIES_1_004  ...       0   4.527344
4         HOBBIES_1_005_CA_1_evaluation  HOBBIES_1_005  ...       0   2.941406
...                                 ...            ...  ...     ...        ...
60034805    FOODS_3_823_WI_3_evaluation    FOODS_3_823  ...       0   2.980469
60034806    FOODS_3_824_WI_3_evaluation    FOODS_3_824  ...       0   2.480469
60034807    FOODS_3_825_WI_3_evaluation    FOODS_3_825  ...       0   3.980469
60034808    FOODS_3_826_WI_3_evaluation    FOODS_3_826  ...       0   1.280273
60034809    FOODS_3_827_WI_3_evaluation    FOODS_3_827  ...       0   1.000000

[60034810 rows x 22 columns]

In [43]:
data = reduce(data)

In [44]:
data.memory_usage().sum()/1024**2

2520.8412704467773

In [51]:
data.dtypes

id                    category
item_id               category
dept_id               category
cat_id                category
store_id              category
state_id              category
day                   category
demand                   int16
date            datetime64[ns]
wm_yr_wk                 int16
weekday               category
wday                      int8
month                     int8
year                     int16
event_name_1          category
event_type_1          category
event_name_2          category
event_type_2          category
snap_CA                   int8
snap_TX                   int8
snap_WI                   int8
sell_price             float16
dtype: object

In [52]:
data['id'].cat.codes

0           14370
1           14380
2           14390
3           14400
4           14410
            ...
60034805    14329
60034806    14339
60034807    14349
60034808    14359
60034809    14369
Length: 60034810, dtype: int16